{
  "useCases": "Case Studies",
  "projects": "Projects",
  "description": "These projects demonstrate my expertise with practical examples of some of my work, including brief descriptions and links to code repositories and live demos. They showcase my ability to tackle intricate challenges, adapt to various technologies, and efficiently oversee projects.",
  "goProject": "Go to project",
  "fonet": {
    "name": "Fonet Pay System",
    "description": [
      "Payment system for ISP Fonet C.A., is a system integrated with Mikrowisp software and different Venezuelan banks to perform the payment process, registration and activation of the services of the company's customers.",
      "Payment system for ISP Fonet C.A., is a system integrated with Mikrowisp software and different Venezuelan banks to perform the payment process, registration and activation of the services of the company's customers.",
      "Payment system for ISP Fonet C.A., is a system integrated with Mikrowisp software and different Venezuelan banks to perform the payment process, registration and activation of the services of the company's customers."
    ]
  },
  "noticieroamerica": {
    "name": "Noticiero América Web",
    "description": [
      "This project is a news portal, which allows the publication of news, videos, images, and other content. It has a system of users with different roles, which allows the administration of the portal."
    ]
  },
  "sanmartin": {
    "name": "San Martin App",
    "description": [
      "Aplication for the San Martin University, which allows the publication of news, videos, images, and other content. It has a system of users with different roles, which allows the administration of the portal."
    ]
  },
  "diversogroup": {
    "name": "Diverso Group Web",
    "description": [
      "Web for Diverso Group Agency in Venezuela, which allows the publication of news, videos, images, and other content. It has a system of users with different roles, which allows the administration of the portal."
    ]
  },
  "transportex": {
    "name": "Transportex App",
    "description": [
      "App for Transportex Agency in Venezuela, which allows the publication of news, videos, images, and other content. It has a system of users with different roles, which allows the administration of the portal."
    ]
  },
  "froz": {
    "name": "Froz Sports Development",
    "description": [
      "Web portal for the Froz Sports Development company, which allows the publication of news, videos, images, and other content. It has a system of users with different roles, which allows the administration of the portal."
    ]
  },
  "isuzu-orders": {
    "name": "Isuzu Orders System",
    "description": [
      "System for Isuzu Motors Venezuela, which allows the registration of orders, customers, products, and other data. It has a system of users with different roles, which allows the administration of the portal."
    ]
  },
  "isuzu-kpi": {
    "name": "Isuzu KPI System",
    "description": [
      "System for Isuzu Motors Venezuela, which allows the registration of KPIs, customers, products, and other data. It has a system of users with different roles, which allows the administration of the portal."
    ]
  }
}
